In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

## Series

In [2]:
obj = Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

通常，我们希望所创建Series带有一个可以对各个数据点进行标记的索引：

In [5]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [6]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [7]:
obj2['a']

-5

In [8]:
obj2['d'] = 6

In [9]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [10]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [11]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [12]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [13]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

还可以将Series看成是一个定长的有序字典，因为它是索引值到数据值的一个映射。

In [14]:
'b' in obj2

True

In [15]:
'e' in obj2

False

如果数据被存放在一个Python字典中，也可以直接通过这个字典来创建Series：

In [16]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [17]:
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

如果只传入一个字典，则结果Series中的索引就是原字典的键（有序排列）：

In [18]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [19]:
obj4 = Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

由于“California”所对应的sdata值找不到，所以其结果就为NaN（not a number），在pandas中，它用于表示缺失或NA值。

In [20]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [21]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [22]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

Series最重要的一个功能是：它在算术运算中会自动对齐不同索引的数据

In [23]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [24]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [25]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

Series对象本身及其索引都有一个name属性：

In [26]:
obj4.name = 'population'

In [27]:
obj4.index.name = 'state'

In [28]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

Series的索引可以通过赋值的方式就地修改：

In [29]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [30]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

## DataFrame

In [31]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)

In [32]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

如果指定了列序列，则DataFrame的列就会按照指定顺序进行排列：

In [33]:
DataFrame(data,columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

跟Series一样，如果传入的列在数据中找不到，就会产生NA值：

In [34]:
frame2 = DataFrame(data,columns=['year', 'state', 'pop', 'debt'],
                  index=['one', 'two', 'there', 'four', 'five'])

In [35]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
there  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [36]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

通过类似字典标记的方式或属性的方式，可以将DataFrame的列获取为一个Series：

In [37]:
frame2['state']

one        Ohio
two        Ohio
there      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [38]:
frame2.year

one      2000
two      2001
there    2002
four     2001
five     2002
Name: year, dtype: int64

注意，返回的Series拥有DataFrame相同的索引，且其name属性也已经被相应地设置好了。  
行也可以通过位置或名称的方式进行获取，比如用索引字段ix：

In [39]:
frame2.ix['four']

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

year       2001
state    Nevada
pop         2.4
debt        NaN
Name: four, dtype: object

列可以通过赋值的方式进行修改。  
给空的“debt”列赋上一个标量值或者一组值：

In [40]:
frame2['debt'] = 16.5

In [41]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
there  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [42]:
frame2['debt'] = np.arange(5.)

In [43]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
there  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

将列表或数组赋值给某个列时，其长度必须跟DataFrame的长度相匹配。如果赋值的是一个Series，就会精确匹配DataFrame的索引，所有的空位都将被填上缺失值：

In [44]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [45]:
frame2['debt'] = val

In [46]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
there  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

为不存在的列赋值会创建出一个新列。关键字del用于删除列：

In [47]:
frame2['eastern'] = frame2.state == 'Ohio'

In [48]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
there  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [49]:
del frame2['eastern']

In [50]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

另一种常见的数据形式是嵌套字典：

In [51]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

如果将它传给DataFrame，就会被解释为：外层字典的键作为列，内层键则作为行索引：

In [52]:
frame3 = DataFrame(pop)

In [53]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

对该结果进行转置：

In [54]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

内层字典的键会被合并、排序以形成最终的索引。如果显示指定了索引，则不会这样：

In [55]:
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

如果设置了DataFrame的index和columns的name属性，则这些信息也会被显示出来：

In [56]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [57]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

跟Series一样，values属性也会以二维ndarray的形式返回DataFrame中的数据：

In [58]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

如果DataFrame各列的数据类型不同，则值数组的数据类型就会选用能兼容所有列的数据类型：

In [59]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

## 索引对象

pandas的索引对象负责管理轴标签和其他元数据（比如轴名称等）。  
构建Series或DataFrame时，所用到的任何数组或其他序列的标签都会被转换成一个Index：

In [60]:
obj = Series(range(3), index=['a', 'b', 'c'])

In [61]:
index = obj.index

In [62]:
index

Index(['a', 'b', 'c'], dtype='object')

In [63]:
index[1:]

Index(['b', 'c'], dtype='object')

Index对象是不可修改的（immutable），因此用户不能对其进行修改：
```
index[1] = 'd'
TypeError: Index does not support mutable operations
```

不可修改性非常重要，因为这样才能使Index对象在多个数据结构之间安全共享：

In [64]:
index = pd.Index(np.arange(3))
index

Int64Index([0, 1, 2], dtype='int64')

In [65]:
obj2 = Series([1.5, -2.5, 0], index=index)

In [66]:
obj2.index is index

True

除了长得像数组，Index的功能也类似一个固定大小的集合：

In [67]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [68]:
'Ohio' in frame3.columns

True

In [69]:
2003 in frame3.index

False

## 重新索引
reindex，作用是创建一个适应新索引的新对象

In [70]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [71]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

调用该Series的reindex将会根据新索引进行重排。如果某个索引值当前不存在，就引入缺失值：

In [72]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [73]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [74]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

重新索引时可能需要做一些插值处理，method方法可以达到此目的：

In [75]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [76]:
obj3.reindex(range(6), method='ffill') # 向前填充（向下填充，前面补后面）

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

对于DataFrame，reindex可以修改（行）索引、列，或者两个都修改。如果仅传入一个序列，则会重新索引行：

In [77]:
frame = DataFrame(np.arange(9).reshape((3,3)), index=['a', 'c', 'd'],
                  columns=['Ohio', 'Texas', 'California'])

In [78]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [79]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [80]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

使用columns关键字即可重新索引列：

In [81]:
states = ['Texas', 'Utah', 'California']

In [82]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

也可以同时对行和列进行重新索引，而插值则只能按行应用（即轴0）：  
```
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill',columns=states)
ValueError: index must be monotonic increasing or decreasing

```

**这里使用ffill，索引必须是单调增加或减少，故不能这样写**

In [83]:
frame.reindex(index=['a','b','c','d'],
              columns=states).ffill()

   Texas  Utah  California
a    1.0   NaN         2.0
b    1.0   NaN         2.0
c    4.0   NaN         5.0
d    7.0   NaN         8.0

利用ix的标签索引功能，重新索引任务可以变得更简洁：

In [84]:
frame.ix[['a', 'b', 'c', 'd'], states]

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

## 丢弃指定轴上的项
drop

In [85]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [86]:
new_obj = obj.drop('c')

In [87]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [88]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

对于DataFrame，可以删除任意轴上的索引值：

In [89]:
data = DataFrame(np.arange(16).reshape((4,4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [90]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [91]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [92]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

## 索引、选取和过滤

In [93]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [94]:
obj['b']

1.0

In [95]:
obj[1]

1.0

In [96]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [97]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [98]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [99]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

利用标签的切片运算和普通的Python切片运算不同，其末端是包含的（inclusive），即封闭区间：

In [100]:
obj['b':'c'] # 包括obj['b]和obj['c]

b    1.0
c    2.0
dtype: float64

In [101]:
obj['b':'c'] = 5

In [102]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

对DataFrame进行索引其实就是获取一个或多个列：

In [103]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['One', 'two', 'three', 'four'])

In [104]:
data

          One  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [105]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [106]:
data[['three', 'One']]

          three  One
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

这种索引方式有几个特殊的情况。首先通过切片或布尔型数组选取行：

In [107]:
data[:2]

          One  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [108]:
data[data['three'] > 5]

          One  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [109]:
data < 5

            One    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [110]:
data[data < 5] = 0

In [111]:
data

          One  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [112]:
data.ix['Colorado', ['two', 'three']]

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

two      5
three    6
Name: Colorado, dtype: int32

In [113]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  One  two
Colorado     7    0    5
Utah        11    8    9

In [114]:
data.ix[2]

One       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [115]:
data.ix[:'Utah', 'two'] # 这里利用标签“Utah”切片，是闭区间包含“Utah”

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [116]:
data.ix[data.three > 5, :3]

          One  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

## 算术运算和数据对齐

In [117]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [118]:
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [119]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [120]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [121]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

对于DataFrame，对齐操作会同时发生在行和列上：

In [122]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)),
                columns=list('bcd'),
                index=['Ohio', 'Texas', 'Colorado'])

In [123]:
df2 = DataFrame(np.arange(12.).reshape((4, 3)),
                columns=list('bde'),
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [124]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [125]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [126]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

## 在算术方法中填充值
在对不同索引的对象进行算术运算时，你可能希望当一个对象中某个轴标签在对另一个对象中找不到时填充一个特殊值（比如0）：

In [127]:
df1.add(df2, fill_value=0)

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      3.0  1.0   6.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0   8.0
Utah      0.0  NaN   1.0   2.0

In [128]:
df1 = DataFrame(np.arange(12.).reshape((3,4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4,5)), columns=list('abcde'))

In [129]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [130]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [131]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [132]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

与此类似，在对Series或DataFrame重新索引时，也可以指定一个填充值：

In [133]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

## DataFrame和Series之间的运算

In [134]:
arr = np.arange(12.).reshape((3, 4))

In [135]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [136]:
arr[0]

array([0., 1., 2., 3.])

In [137]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

这就叫做广播（broadcasting），DataFrame和Series之间的运算差不多也是如此：

In [138]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [139]:
series = frame.ix[0]

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [140]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [141]:
series

b    0
d    1
e    2
Name: Utah, dtype: int32

In [142]:
frame - series

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

如果你希望匹配行且在列上广播，则必须使用算术运算方法。例如：

In [143]:
series3 = frame['d']

In [144]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [145]:
series3

Utah       1
Ohio       4
Texas      7
Oregon    10
Name: d, dtype: int32

add和sub（subtract）默认轴都是1，如果想在列上广播，则要设置axis=0
>Signature: frame.sub(other, axis='columns', level=None, fill_value=None)  
Docstring:
Subtraction of dataframe and other, element-wise (binary operator `sub`).

In [146]:
frame.sub(series3) # sub默认设置axis='columns'

        Ohio  Oregon  Texas  Utah   b   d   e
Utah     NaN     NaN    NaN   NaN NaN NaN NaN
Ohio     NaN     NaN    NaN   NaN NaN NaN NaN
Texas    NaN     NaN    NaN   NaN NaN NaN NaN
Oregon   NaN     NaN    NaN   NaN NaN NaN NaN

In [147]:
frame.sub(series3, axis=0)

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

## 函数应用和映射
NumPy的ufunc（元素级数组方法）也可用于操作pandas对象：

In [148]:
frame = DataFrame(np.random.randn(4, 3),
                  columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [149]:
frame

               b         d         e
Utah    0.302219  0.359550  0.760369
Ohio    0.226295 -0.430886  0.467799
Texas   0.449148 -0.102267  0.396199
Oregon  0.030513 -0.201287  1.362125

In [150]:
np.abs(frame)

               b         d         e
Utah    0.302219  0.359550  0.760369
Ohio    0.226295  0.430886  0.467799
Texas   0.449148  0.102267  0.396199
Oregon  0.030513  0.201287  1.362125

另一种常见的操作是，将函数应用到由各列或行所形成的一维数组上。DataFrame的apply方法即可实现此功能：

In [151]:
f = lambda x: x.max() - x.min()

In [152]:
frame.apply(f) # 默认axis=0

b    0.418635
d    0.790436
e    0.965926
dtype: float64

In [153]:
frame.apply(f, axis=1)

Utah      0.458149
Ohio      0.898685
Texas     0.551415
Oregon    1.563412
dtype: float64

除标量值外，传递给apply的函数还可以返回由多个值组成的Series：

In [154]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])

In [155]:
frame.apply(f)

            b         d         e
min  0.030513 -0.430886  0.396199
max  0.449148  0.359550  1.362125

此外，元素级的Python函数也是可以用的。加入你想得到frame中各个浮点值的格式化字符串，使用applymap即可：

In [156]:
format  = lambda x: '%.2f' % x

In [157]:
frame.applymap(format)

           b      d     e
Utah    0.30   0.36  0.76
Ohio    0.23  -0.43  0.47
Texas   0.45  -0.10  0.40
Oregon  0.03  -0.20  1.36

之所以叫做applymap，是因为Series有一个用于应用元素级函数的map方法：

In [158]:
frame['e'].map(format)

Utah      0.76
Ohio      0.47
Texas     0.40
Oregon    1.36
Name: e, dtype: object

## 排序和排名

In [159]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])

In [160]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [161]:
frame = DataFrame(np.arange(8).reshape((2,4)), 
                  index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])

In [162]:
frame.sort_index() # 默认axis=0

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [163]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

数据默认是按升序排序的，但也可以降序排序：

In [164]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

若要按值对Series进行排序，可使用其sort_values方法：

In [165]:
obj = Series([4, 7, -3, 2])

In [166]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

在排序时，任何缺失值默认都会被放到Series的末尾：

In [167]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])

In [168]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

在DataFrame上，根据一个或多个列中的值进行排序时，将名字传递给by选项即可：

In [169]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [170]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [171]:
frame.sort_index(by='b')

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [172]:
frame.sort_index(by=['a', 'b'])

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

排名（ranking）跟排序关系密切，且它会增设一个排名值（从1开始，一直到数组中有效数据的数量）。它跟numpy.argsort产生的间接排序索引差不多，只不过它可以根据某种规则破坏评级关系。  
默认情况下，rank是通过“为各组分配一个平均排名”的方式破坏平级关系：

In [173]:
obj = Series([7, -5, 7, 4, 2, 0, 4])

In [174]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

也可以根据值在原始数据中出现的顺序给出排名：

In [175]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

也可以按降序进行排名：

In [176]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

DataFrame可以在行或列上计算排名：

In [177]:
frame = DataFrame({'b': [4.3, 7, -3, 2],
                   'a': [0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})

In [178]:
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [179]:
frame.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

## 带有重复值的轴索引

In [180]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [181]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

索引的is_unique属性可以告诉你它的值是否是唯一的：

In [182]:
obj.index.is_unique

False

In [183]:
obj['a'] # 索引对应多个值，返回一个Series

a    0
a    1
dtype: int64

In [184]:
obj['c'] # 索引对应单个值，返回一个标量值

4

In [185]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [186]:
df

          0         1         2
a  0.590529  0.699798  0.255803
a -0.103332 -0.928429  0.288892
b  0.622248  0.408335 -1.419360
b  0.301932 -1.537337  0.362150

In [187]:
df.ix['b']

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          0         1        2
b  0.622248  0.408335 -1.41936
b  0.301932 -1.537337  0.36215

## 汇总和计算描述统计

In [188]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
                [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])

In [189]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [190]:
df.sum() # 默认axis=0

one    9.25
two   -5.80
dtype: float64

In [191]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

NA值会自动被排除，除非整个切片（这里指的是行或列）都是NA。  
通过skipna选项可以禁用该功能：

In [192]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

有些方法，如idxmin和idmax（达到最小值或最大值的索引），返回的是间接统计：

In [193]:
df.idxmax() # 默认axis=0

one    b
two    d
dtype: object

另一些方法则是累计型的：

In [194]:
df.cumsum() # 默认axis=0

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

还有一种方法，它既不是约简型也不是累计型  
describe就是一个例子，它用于一次性产生多个汇总统计：

In [195]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

对于非数值型数据，describe会产生另外一种汇总统计：

In [196]:
obj = Series(['a', 'a', 'b', 'c'] * 4)

In [197]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [198]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

## 关系系数与协方差：

In [199]:
import pandas_datareader as web

In [200]:
all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker, '1/1/2000', '1/1/2010')

In [201]:
price = DataFrame({tic: data['Adj Close'] for tic,data in all_data.items()})

In [202]:
volume = DataFrame({tic: data['Volume'] for tic, data in all_data.items()})

In [203]:
returns = price.pct_change() # 百分率变化，即增长率

In [204]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2009-12-24  0.034339  0.011117  0.004385  0.002587
2009-12-28  0.012295  0.007098  0.013326  0.005484
2009-12-29 -0.011862 -0.005571 -0.003477  0.007058
2009-12-30  0.012147  0.005376  0.005461 -0.013698
2009-12-31 -0.004300 -0.004416 -0.012597 -0.015504

In [205]:
returns.MSFT.corr(returns.IBM) # correlation相关性

0.4925370649472438

In [206]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.470676  0.412392  0.422852
GOOG  0.470676  1.000000  0.390688  0.438313
IBM   0.412392  0.390688  1.000000  0.492537
MSFT  0.422852  0.438313  0.492537  1.000000

In [207]:
returns.cov() # covariance协方差

          AAPL      GOOG       IBM      MSFT
AAPL  0.001030  0.000303  0.000254  0.000309
GOOG  0.000303  0.000580  0.000142  0.000204
IBM   0.000254  0.000142  0.000369  0.000216
MSFT  0.000309  0.000204  0.000216  0.000519

利用DataFrame的corrwith方法，可以计算其列或行跟另一个Series或DataFrame之间的相关系数。  
传入一个Series将会返回一个相关系数值Series（针对各列进行计算）：

In [208]:
returns.corrwith(returns.IBM)

AAPL    0.412392
GOOG    0.390688
IBM     1.000000
MSFT    0.492537
dtype: float64

传入一个DataFrame则会计算按列名配对的相关系数。  
这里计算百分比与成交量的相关系数：

In [209]:
returns.corrwith(volume) # 默认axis=0

AAPL   -0.057664
GOOG    0.062647
IBM    -0.006592
MSFT   -0.016101
dtype: float64

## 唯一值、值计数以及成员资格

In [210]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

unique得到Series中的唯一值数组：

In [211]:
uniques = obj.unique()

In [212]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

value_counts用于计算一个Series中各值出现的频率：

In [213]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

结果默认是按值频率降序排列的。  
value_counts还是一个顶级pandas方法，可用于任何数组或序列：

In [214]:
pd.value_counts(obj.values, sort=False)

b    2
d    1
a    3
c    3
dtype: int64

isin用于判断矢量化集合的成员资格，可用于选取Series和DataFrame列中数据的子集：

In [215]:
mask = obj.isin(['b', 'c'])

In [216]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [217]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

有时，你可能希望得到DataFrame中多个相关列的一张柱状图。例如：

In [218]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})

In [219]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

将pandas.value_counts传给该DataFrame的apply函数，就会出现：

In [220]:
result = data.apply(pd.value_counts).fillna(0)

In [221]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## 处理缺失数据

In [222]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [223]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [224]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

Python内置的None值也会被当作NA处理：

In [225]:
string_data[0] = None

In [226]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

## 滤除缺失数据

In [227]:
from numpy import nan as NA

In [228]:
data = Series([1, NA, 3.5, NA, 7])

In [229]:
data.dropna() # Return Series without null values

0    1.0
2    3.5
4    7.0
dtype: float64

In [230]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

对于DataFrame对象，dropna默认丢弃任何含有缺失值的行：

In [231]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])

In [232]:
cleaned = data.dropna() # 默认axis=0,how='any'即丢弃任何含有缺失值的行

In [233]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [234]:
cleaned

     0    1    2
0  1.0  6.5  3.0

传入how='all'将只丢弃全为NA的那些行：

In [235]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

需要丢弃列，只需传入axis=1即可：

In [236]:
data[4] = NA

In [237]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [238]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

假设你只想留下一部分观测数据，可以用thresh参数实现此目的：

In [239]:
df = DataFrame(np.random.randn(7, 3))

In [240]:
df.ix[:4, 1] = NA;df.ix[:2, 2] = NA

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [241]:
df

          0         1         2
0  0.029503       NaN       NaN
1 -0.648891       NaN       NaN
2 -1.210098       NaN       NaN
3  0.105521       NaN  0.635772
4 -1.336441       NaN -0.028586
5  1.049681  0.521803 -0.068187
6 -0.209208 -0.441649  0.300565

In [242]:
df.dropna(thresh=3)

          0         1         2
5  1.049681  0.521803 -0.068187
6 -0.209208 -0.441649  0.300565

## 填充缺失数据

In [243]:
df.fillna(0)

          0         1         2
0  0.029503  0.000000  0.000000
1 -0.648891  0.000000  0.000000
2 -1.210098  0.000000  0.000000
3  0.105521  0.000000  0.635772
4 -1.336441  0.000000 -0.028586
5  1.049681  0.521803 -0.068187
6 -0.209208 -0.441649  0.300565

若是通过一个字典调用fillna，就可以实现对不同的列填充不同的值：

In [244]:
df.fillna({1: 0.5, 3: -1})

          0         1         2
0  0.029503  0.500000       NaN
1 -0.648891  0.500000       NaN
2 -1.210098  0.500000       NaN
3  0.105521  0.500000  0.635772
4 -1.336441  0.500000 -0.028586
5  1.049681  0.521803 -0.068187
6 -0.209208 -0.441649  0.300565

fillna默认会返回新对象，但也可以对现有对象进行就地修改：

In [245]:
# 总是返回被填充对象的引用
_ =  df.fillna(0, inplace=True)

In [246]:
df

          0         1         2
0  0.029503  0.000000  0.000000
1 -0.648891  0.000000  0.000000
2 -1.210098  0.000000  0.000000
3  0.105521  0.000000  0.635772
4 -1.336441  0.000000 -0.028586
5  1.049681  0.521803 -0.068187
6 -0.209208 -0.441649  0.300565

对reindex有效的那些插值方法也可以用于fillna：

In [247]:
df = DataFrame(np.random.randn(6, 3))

In [248]:
df.ix[2:, 1] = NA; df.ix[4:, 2] = NA

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [249]:
df

          0         1         2
0  0.157700  0.591986 -0.521925
1 -0.078457  0.244141 -0.733347
2 -0.653586       NaN -1.635702
3 -0.553218       NaN -1.443878
4 -0.903779       NaN       NaN
5 -1.080244       NaN       NaN

In [250]:
df.fillna(method='ffill')

          0         1         2
0  0.157700  0.591986 -0.521925
1 -0.078457  0.244141 -0.733347
2 -0.653586  0.244141 -1.635702
3 -0.553218  0.244141 -1.443878
4 -0.903779  0.244141 -1.443878
5 -1.080244  0.244141 -1.443878

In [251]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.157700  0.591986 -0.521925
1 -0.078457  0.244141 -0.733347
2 -0.653586  0.244141 -1.635702
3 -0.553218  0.244141 -1.443878
4 -0.903779       NaN -1.443878
5 -1.080244       NaN -1.443878

传入Series的平均值或中位数：

In [252]:
data = Series([1., NA, 3.5, NA, 7])

In [253]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 层次化索引
层次化索引（hierarchical indexing）是pandas的一项重要功能，它使你能在一个轴上拥有多个（两个以上）索引级别。

In [254]:
data = Series(np.random.randn(10),
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])

In [255]:
data

a  1   -1.077864
   2    0.509009
   3   -0.437827
b  1   -0.252412
   2    0.915660
   3    0.217174
c  1    0.883065
   2   -0.882694
d  2    0.576403
   3   -1.574140
dtype: float64

In [256]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [257]:
data['b']

1   -0.252412
2    0.915660
3    0.217174
dtype: float64

In [258]:
data['b':'c']

b  1   -0.252412
   2    0.915660
   3    0.217174
c  1    0.883065
   2   -0.882694
dtype: float64

In [259]:
data.ix[['b', 'd']]

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

b  1   -0.252412
   2    0.915660
   3    0.217174
d  2    0.576403
   3   -1.574140
dtype: float64

In [260]:
data[:, 2] # “内层”选取

a    0.509009
b    0.915660
c   -0.882694
d    0.576403
dtype: float64

这段数据可以通过其unstack方法重新安排到一个DataFrame中：

In [261]:
data.unstack() # 默认level=-1

          1         2         3
a -1.077864  0.509009 -0.437827
b -0.252412  0.915660  0.217174
c  0.883065 -0.882694       NaN
d       NaN  0.576403 -1.574140

unstack的逆运算是stack：

In [262]:
data.unstack().stack()

a  1   -1.077864
   2    0.509009
   3   -0.437827
b  1   -0.252412
   2    0.915660
   3    0.217174
c  1    0.883065
   2   -0.882694
d  2    0.576403
   3   -1.574140
dtype: float64

对于一个DataFrame，每条轴都可以有分层索引：

In [263]:
frame = DataFrame(np.arange(12).reshape((4,3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])

In [264]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

各层都可以有名字：

In [265]:
frame.index.names = ['key1', 'key2']

In [266]:
frame.columns.names = ['state', 'color']

In [267]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [268]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

可以单独创建MultiIndex然后复用

In [269]:
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],
                          names=['state', 'color'])

MultiIndex(levels=[['Colorado', 'Ohio'], ['Green', 'Red']],
           labels=[[1, 1, 0], [0, 1, 0]],
           names=['state', 'color'])

## 重排分级顺序
重新调整某条轴上各级别的顺序，或根据指定级别上的值对数据进行排序。  swaplevel接受两个级别编号或名称，闭关返回一个互换了级别的新对象（但数据不会发生变化）：

In [270]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [271]:
frame.sortlevel(1) # FutureWarning: sortlevel is deprecated, use sort_index(level= ...)

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [272]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [273]:
frame.swaplevel(0, 1).sort_index(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

## 根据级别汇总统计
level选项用于指定在某条轴上求和的级别。

In [274]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [275]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

## 使用DataFrame的列

In [276]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})

In [277]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

DataFrame的set_index函数会将其一个或多个列转换为行索引，并创建一个新的DataFrame：

In [278]:
frame2 = frame.set_index(['c', 'd'])

In [279]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

默认情况下，那些列会从DataFrame中移除，但也可以将其保留下来：

In [280]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

reset_index的功能和set_index刚好相反，层次化索引的级别会被转移到里面：

In [281]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1